app/views/gossip/show_id.html.erb

  <ul class="list-group list-group-flush">
    <li class="list-group-item"> Author : <%= @gossip.user.first_name %> </li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]