app/views/gossip/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  <div class="card-body">
    <h5 class="card-title"> Author : <%= gossip.user.first_name %> </h5>