app/controllers/gossip_controller.rb

SELECT "gossips".* FROM "gossips"
---
	def show
		@gossip = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show_id
		@gossip = Gossip.find(params[:id])
		@user = User.find(params[:id])